Jakub Szczudło, 302925

In [5]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [16]:
df2 = pd.DataFrame(np.array([["Andrzej","Duda",49,"male"],
                             ["Jarosław", "Kowalski", 73, "male"],
                             ["Jakub","Mordęga", 22, "male"],
                             ["Donald","Tusk",67,"male"],
                            ["Wilhem","Zdobywca",100,"male"]]),
                   columns=['name', 'surname', 'age','sex'])

In [17]:
df2

       name   surname  age   sex
0   Andrzej      Duda   49  male
1  Jarosław  Kowalski   73  male
2     Jakub   Mordęga   22  male
3    Donald      Tusk   67  male
4    Wilhem  Zdobywca  100  male

Dane dobrano całkowicie przypadkowo

In [20]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      object
 3   sex      5 non-null      object
dtypes: object(4)
memory usage: 288.0+ bytes

In [21]:
df2.describe()

           name surname age   sex
count         5       5   5     5
unique        5       5   5     1
top     Andrzej    Duda  49  male
freq          1       1   1     5

In [23]:
df2.head(3)

       name   surname age   sex
0   Andrzej      Duda  49  male
1  Jarosław  Kowalski  73  male
2     Jakub   Mordęga  22  male

Wszystkie polecenia wykonano pomyślnie